In [1]:
import pandas as pd 
df = pd.read_csv('titanic.csv')

In [2]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df = df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns')
df.head(3)

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250

In [4]:
inputs = df.drop(['Survived'],axis='columns')
target = df['Survived']

In [5]:
inputs.isna().sum().sum()

177

In [6]:
inputs.head(3)

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250

In [7]:
inputs['Age'].isna().sum()

177

In [8]:
len(inputs['Age'])

891

In [9]:
import math
mean_age = math.floor(inputs.Age.mean())
mean_age

29

In [10]:
inputs['Age'] = inputs['Age'].fillna(mean_age)
inputs['Age'].isna().sum()

0

In [11]:
from sklearn.preprocessing import LabelEncoder
lb = LabelEncoder()
inputs.Sex = lb.fit_transform(inputs.Sex)
# or inputs.Sex = inputs.Sex.map({'male':1,'female':2})
inputs.head(3)

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    0  38.0  71.2833
2       3    0  26.0   7.9250

In [12]:
# 1-Male, 0-Female

In [30]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(inputs,target,test_size=0.15)

In [31]:
len(x_train)

757

In [32]:
len(x_test)

134

In [33]:
from sklearn.tree import DecisionTreeClassifier
model = DecisionTreeClassifier()
model.fit(x_train.values,y_train)

DecisionTreeClassifier()

In [34]:
model.score(x_test.values,y_test)

0.8059701492537313

In [18]:
md = DecisionTreeClassifier()
md.fit(inputs,target)

DecisionTreeClassifier()

In [19]:
md.score(inputs,target)

0.9741863075196409